index.org
#+TITLE: http.async.client - Asynchronous HTTP Client - Clojure
#+AUTHOR: Hubert Iwaniuk
#+EMAIL: neotyk@kungfoo.pl
#+INFOJS_OPT: view:info toc:1

*http.async.client* is Asynchronous HTTP Client for Clojure.

* *tl;dr*

  Declare dependency:
#+BEGIN_SRC clojure
  (defproject your-project "1.0.0-SNAPSHOT"
    :description "Your project description"
    :dependencies [[org.clojure/clojure "1.2.0"]
                   [org.clojure/clojure-contrib "1.2.0"]
                   [http.async.client "0.2.0"]])
#+END_SRC

  Require:
#+BEGIN_SRC clojure
  (ns sample (:require [http.async.client :as c]))
#+END_SRC

  GET resource:
#+BEGIN_SRC clojure
  (let [response (c/GET "http://github.com/neotyk/http.async.client/")]
    (c/await response)
    (c/string response))
#+END_SRC

* Information over *http.async.client*

  [[http://github.com/neotyk/http.async.client][*http.async.client*]] is based on [[http://github.com/AsyncHttpClient/async-http-client][Asynchronous Http Client for Java]]
  which runs on top of [[http://jboss.org/netty][Netty Project]].

  It requires Clojure 1.2.

  For more documentation refer to [[./docs.org][docs]] and for API to [[http://neotyk.github.com/http.async.client/autodoc/][autodoc]].

  *http.async.client* is distributed under [[http://www.apache.org/licenses/LICENSE-2.0.html][Apache License, Version 2.0]].

  If you would like to help please look at [[./todo.org][to do]] or submit ticket
  [[http://github.com/neotyk/http.async.client/issues/][here]].
