index.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>http.async.client - Asynchronous HTTP Client - Clojure</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-09-12 09:43:44 CEST"/>
<meta name="author" content="Hubert Iwaniuk"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">http.async.client - Asynchronous HTTP Client - Clojure</h1>

<p><b>http.async.client</b> is Asynchronous HTTP Client for Clojure.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 <b>tl;dr</b> </a></li>
<li><a href="#sec-2">2 Information over <b>http.async.client</b> </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <b>tl;dr</b> </h2>
<div class="outline-text-2" id="text-1">


<p>
Declare dependency:
</p>


<pre class="src src-clojure"><span style="color: #7f7f7f;">(</span>defproject your-project <span style="color: #cc9393;">"1.0.0-SNAPSHOT"</span>
  <span style="color: #8cd0d3;">:description</span> <span style="color: #cc9393;">"Your project description"</span>
  <span style="color: #8cd0d3;">:dependencies</span> [[org.clojure/clojure <span style="color: #cc9393;">"1.2.0"</span>]
                 [org.clojure/clojure-contrib <span style="color: #cc9393;">"1.2.0"</span>]
                 [http.async.client <span style="color: #cc9393;">"0.2.0"</span>]]<span style="color: #7f7f7f;">)</span>
</pre>




<p>
Require:
</p>


<pre class="src src-clojure"><span style="color: #7f7f7f;">(</span><span style="color: #f0dfaf; font-weight: bold;">ns</span> sample <span style="color: #7f7f7f;">(</span><span style="color: #8cd0d3;">:require</span> [http.async.client <span style="color: #8cd0d3;">:as</span> c]<span style="color: #7f7f7f;">))</span>
</pre>




<p>
GET resource:
</p>


<pre class="src src-clojure"><span style="color: #7f7f7f;">(</span><span style="color: #f0dfaf; font-weight: bold;">let</span> [response <span style="color: #7f7f7f;">(</span>c/GET <span style="color: #cc9393;">"http://github.com/neotyk/http.async.client/"</span><span style="color: #7f7f7f;">)</span>]
  <span style="color: #7f7f7f;">(</span>c/await response<span style="color: #7f7f7f;">)</span>
  <span style="color: #7f7f7f;">(</span>c/string response<span style="color: #7f7f7f;">))</span>
</pre>




</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Information over <b>http.async.client</b> </h2>
<div class="outline-text-2" id="text-2">


<p>
<a href="http://github.com/neotyk/http.async.client"><b>http.async.client</b></a> is based on <a href="http://github.com/AsyncHttpClient/async-http-client">Asynchronous Http Client for Java</a>
which runs on top of <a href="http://jboss.org/netty">Netty Project</a>.
</p>
<p>
It requires Clojure 1.2.
</p>
<p>
For more documentation refer to <a href="./docs.html">docs</a> and for API to <a href="http://neotyk.github.com/http.async.client/autodoc/">autodoc</a>.
</p>
<p>
<b>http.async.client</b> is distributed under <a href="http://www.apache.org/licenses/LICENSE-2.0.html">Apache License, Version 2.0</a>.
</p>
<p>
If you would like to help please look at <a href="./todo.html">to do</a> or submit ticket
<a href="http://github.com/neotyk/http.async.client/issues/">here</a>.
</p></div>
</div>
<div id="postamble">
<p class="author"> Author: Hubert Iwaniuk
<a href="mailto:neotyk@kungfoo.pl">&lt;neotyk@kungfoo.pl&gt;</a>
</p>
<p class="date"> Date: 2010-09-12 09:43:44 CEST</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
